#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_project_service.cloudresourcemanager: Refreshing state... [id=de-challengue-test/cloudresourcemanager.googleapis.com]
google_project_service.project["container.googleapis.com"]: Refreshing state... [id=de-challengue-test/container.googleapis.com]
google_project_service.project["cloudfunctions.googleapis.com"]: Refreshing state... [id=de-challengue-test/cloudfunctions.googleapis.com]
google_project_service.project["compute.googleapis.com"]: Refreshing state... [id=de-challengue-test/compute.googleapis.com]
google_project_service.project["iam.googleapis.com"]: Refreshing state... [id=de-challengue-test/iam.googleapis.com]
google_project_service.project["datastudio.googleapis.com"]: Refreshing state... [id=de-challengue-test/datastudio.googleapis.com]
google_project_service.project["iamcredentials.googleapis.com"]: Refreshing state... [id=de-challengue-test/iamcredentials.googleapis.com]
google_project_service.project["bigquery.googleapis.com"]: Refreshing state... [id=de-challengue-test/bigquery.googleapis.com]
google_project_service.project["storage-component.googleapis.com"]: Refreshing state... [id=de-challengue-test/storage-component.googleapis.com]
google_project_service.project["cloudbuild.googleapis.com"]: Refreshing state... [id=de-challengue-test/cloudbuild.googleapis.com]
google_project_service.project["appengine.googleapis.com"]: Refreshing state... [id=de-challengue-test/appengine.googleapis.com]
google_project_service.project["dataflow.googleapis.com"]: Refreshing state... [id=de-challengue-test/dataflow.googleapis.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.landing-bucket-metascore.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "de-challengue-test-metascore-lnd"
      + project                     = "de-challengue-test"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = false
        }
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-lnd"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Gustavo.Aguilar0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-lnd"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Mariano.Gonzalez0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challengue-test-metascore-lnd"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahidale.zg@gmail.com"
      + role   = "roles/storage.objectAdmin"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ZahidGalea, Action: `pull_request`, Working Directory: `infraestructure/terraform/de-challenge-test`, Workflow: `Terraform Planning`*